Assignment-2
Pandas

# Q.1 Create a dataset as follow in the table.

In [5]:
import pandas as pd;
data={
    "Tid":[1,2,3,4,5,6,7,8,9,10],
    "Refund":["yes","No","No","Yes","No","No","Yes","No","No","No"],
    "Marital Status":["S","M","S","M","D","M","D","S","M","S"],
    "Taxablec_Income":["125k","100k","70k","120k","95k","60k","220k","85k","75k","90k"],
    "Cheat":["No","No","No","No","Yes","No","No","Yes","No","Yes"]
}
df=pd.DataFrame(data)
print(df)
print("1st row :\n",df.loc[[0], :])
print("4th row : \n",df.loc[[4],:])
print("7th row :\n",df.loc[[7],:])
print("8th row :\n",df.loc[[8],:])

# df.to_csv("employee_data.csv",index=False)

data=pd.read_csv("employee_data.csv")
data

   Tid Refund Marital Status Taxablec_Income Cheat
0    1    yes              S            125k    No
1    2     No              M            100k    No
2    3     No              S             70k    No
3    4    Yes              M            120k    No
4    5     No              D             95k   Yes
5    6     No              M             60k    No
6    7    Yes              D            220k    No
7    8     No              S             85k   Yes
8    9     No              M             75k    No
9   10     No              S             90k   Yes
1st row :
    Tid Refund Marital Status Taxablec_Income Cheat
0    1    yes              S            125k    No
4th row :
    Tid Refund Marital Status Taxablec_Income Cheat
4    5     No              D             95k   Yes
7th row :
    Tid Refund Marital Status Taxablec_Income Cheat
7    8     No              S             85k   Yes
8th row :
    Tid Refund Marital Status Taxablec_Income Cheat
8    9     No              M             75k    No

   Tid Refund Marital Status Taxablec_Income Cheat
0    1    yes              S            125k    No
1    2     No              M            100k    No
2    3     No              S             70k    No
3    4    Yes              M            120k    No
4    5     No              D             95k   Yes
5    6     No              M             60k    No
6    7    Yes              D            220k    No
7    8     No              S             85k   Yes
8    9     No              M             75k    No
9   10     No              S             90k   Yes

Understanding Attribute Types Using Python

In [41]:
# ï‚· Represent the following:
# o Nominal attributes (e.g., names, departments)
# o Binary attributes (e.g., gender, pass/fail)
# o Ordinal attributes (e.g., low < medium < high)
# o Numeric attributes (continuous and discrete) 

# Q.4 Understanding Attribute Types Using Python
# Representing Nominal, Binary, Ordinal, and Numeric attributes

import pandas as pd
from pandas.api.types import CategoricalDtype


df = pd.read_csv("attribute_example.csv")

print("Dataset:\n", df, "\n")

# -----------------------------
# Step 2: Nominal Attributes
# -----------------------------
print("Nominal Attributes (Name, Department):")
print(df[["Name", "Department"]].head(), "\n")

# -----------------------------
# Step 3: Binary Attributes
# -----------------------------
df["Gender_binary"] = df["Gender"].map({"Male": 1, "Female": 0})
df["Pass_binary"] = df["Pass/Fail"].map({"Pass": 1, "Fail": 0})
print("Binary Attributes (Gender, Pass/Fail):")
print(df[["Gender", "Gender_binary", "Pass/Fail", "Pass_binary"]], "\n")

# # -----------------------------
# # Step 4: Ordinal Attributes
# # -----------------------------
performance_order=CategoricalDtype(categories=["Low","Medium","High"],ordered=True)
df['Performance_order']=(df['Performance'].astype(performance_order).cat.codes)
df


# # -----------------------------
# # Step 5: Numeric Attributes
# # -----------------------------
print("Numeric Attributes:")
print("Age (Discrete):", df["Age"].dtype)
print("Marks (Continuous):", df["Marks"].dtype)

Dataset:
      Name Department  Gender Pass/Fail Performance  Age  Marks
0    Aman         CS    Male      Pass         Low   21   65.5
1     Raj         IT    Male      Fail        High   23   70.0
2  Simran         HR  Female      Pass      Medium   22   80.2
3    Neha    Finance  Female      Pass         Low   24   55.3
4   Vikas         CS    Male      Fail        High   23   60.7
5   Priya         IT  Female      Pass      Medium   25   85.5
6   Arjun         HR    Male      Fail         Low   22   72.4
7   Kiran    Finance  Female      Pass        High   26   90.0

Numeric Attributes:
Age (Discrete): int64
Marks (Continuous): float64

In [57]:

# Q.5 Navigate the DataFrame and do the following task for the table created in question
# 1:
# 1. Select row from index 3 to 7.
# 2. Select row from index 4 to 8, and column 2 to 4.
# 3. Select all rows with column index 1 to 3 (include index 3 during selection).

data=pd.read_csv('employee_data.csv')
print("select row from 3 index to 7 \n",data.iloc[3:8].to_string(index=False))
print("select row from 4 index to 8 and column 2 to 4 \n",data.iloc[4:9,2:5].to_string(index=False))
print("select all row with column 1 to 4 \n",data.iloc[:,1:4].to_string(index=False))

select row from 3 index to 7
  Tid Refund Marital Status Taxablec_Income Cheat
   4    Yes              M            120k    No
   5     No              D             95k   Yes
   6     No              M             60k    No
   7    Yes              D            220k    No
   8     No              S             85k   Yes
select row from 4 index to 8 and column 2 to 4
 Marital Status Taxablec_Income Cheat
             D             95k   Yes
             M             60k    No
             D            220k    No
             S             85k   Yes
             M             75k    No
select all row with column 1 to 4
 Refund Marital Status Taxablec_Income
   yes              S            125k
    No              M            100k
    No              S             70k
   Yes              M            120k
    No              D             95k
    No              M             60k
   Yes              D            220k
    No              S             85k
    No              M             75k
    No              S             90k

In [58]:
# Q.6 Read a csv file and display its first five rows. 

df=pd.read_csv('employee_data.csv')
df.head()

   Tid Refund Marital Status Taxablec_Income Cheat
0    1    yes              S            125k    No
1    2     No              M            100k    No
2    3     No              S             70k    No
3    4    Yes              M            120k    No
4    5     No              D             95k   Yes

In [66]:
# Q.7 From the csv file (uploaded in the Q.6) delete row 4, and delete column 3. Display
# the result. 

df=pd.read_csv('employee_data.csv')
print("data before delete :\n",df)
df.drop(4)
df=df.drop('Marital Status', axis=1)
print("data after delete :\n",df)

data before delete :
    Tid Refund Marital Status Taxablec_Income Cheat
0    1    yes              S            125k    No
1    2     No              M            100k    No
2    3     No              S             70k    No
3    4    Yes              M            120k    No
4    5     No              D             95k   Yes
5    6     No              M             60k    No
6    7    Yes              D            220k    No
7    8     No              S             85k   Yes
8    9     No              M             75k    No
9   10     No              S             90k   Yes
data after delete :
    Tid Refund Taxablec_Income Cheat
0    1    yes            125k    No
1    2     No            100k    No
2    3     No             70k    No
3    4    Yes            120k    No
4    5     No             95k   Yes
5    6     No             60k    No
6    7    Yes            220k    No
7    8     No             85k   Yes
8    9     No             75k    No
9   10     No             90k   Yes

In [69]:
# Employee_ID Name Department Age Salary Years_of_Experience Joining_Date Gender Bonus Rating

import pandas as pd 

data=pd.DataFrame({
    "Employee_ID":[101,102,103,104,105],
    "Name":["Alice","Bob","Charlie","Diana","Edward"],
    "Department":["HR","IT","IT","Marketing","Sales"],
    "Age":[29,34,41,28,38],
    "Salary":[50000,70000,65000,55000,60000],
    "Years_of_Experience":[4,8,10,3,12],
    "Joining_Date":["2020-03-15","2017-07-19","2013-06-01","2021-02-10","2010-11-25" ],
    "Gender":["Female","Male","Male","Female","Male"],
    "Bonus":[5000,7000,6000,4500,5000],
    "Rating":["4.5","4.0","3.8","4.7","3.5"],
})
data["Joining_Date"] = pd.to_datetime(data["Joining_Date"])

data

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5